class Constants:
    # Текст ответов на часто задаваемые вопросы
    QNA_TEXT_PRICE = 'Сутки — 400 рублей. Оплата курьеру — наличными или картой.'
    QNA_FEW_SCOOTERS = 'Пока что у нас так: один заказ — один самокат. Если хотите покататься с друзьями, можете просто сделать несколько заказов — один за другим.'
    QNA_RENT_TIME = 'Допустим, вы оформляете заказ на 8 мая. Мы привозим самокат 8 мая в течение дня. Отсчёт времени аренды начинается с момента, когда вы оплатите заказ курьеру. Если мы привезли самокат 8 мая в 20:30, суточная аренда закончится 9 мая в 20:30.'
    QNA_ORDER_TODAY = 'Только начиная с завтрашнего дня. Но скоро станем расторопнее.'
    QNA_ORDER_LONGER = 'Пока что нет! Но если что-то срочное — всегда можно позвонить в поддержку по красивому номеру 1010.'
    QNA_CHARGE = 'Самокат приезжает к вам с полной зарядкой. Этого хватает на восемь суток — даже если будете кататься без передышек и во сне. Зарядка не понадобится.'
    QNA_ORDER_CANCEL = 'Да, пока самокат не привезли. Штрафа не будет, объяснительной записки тоже не попросим. Все же свои.'
    QNA_ABROAD_CITY = 'Да, обязательно. Всем самокатов! И Москве, и Московской области.'

    # Ссылки на используемые в тестах сайты
    URL = 'https://qa-scooter.praktikum-services.ru'
    DZEN_URL = 'https://dzen.ru/?yredirect=true'
    SCOOTER_URL = 'https://qa-scooter.praktikum-services.ru/'

    # Первый набор данных для проверки формы регистрации
    NAME_1 = 'Иван'
    SURNAME_1 = 'Иванов'
    ADDRESS_1 = 'Ленина 15'
    PHONE_1 = '+79999999999'
    COMMENT_1 = 'комментарий'
    # Второй набор данных для проверки формы регистрации
    NAME_2 = 'Петр'
    SURNAME_2 = 'Петров'
    ADDRESS_2 = 'Ленина 16'
    PHONE_2 = '+79999999998'
    COMMENT_2 = 'с наступающим тех кто это проверяет'